{
  "branding": {
    "name": "Yusuf",
    "fullName": "Yusuf Umar Hanafi",
    "avatarUrl": "https://avatars.githubusercontent.com/u/29970198?v=4",
    "avatar": "YU",
    "brandingName": "MeetUcup"
  },
  "sections": {
    "home": {
      "title": "Hi, I'm {{branding.name}}",
      "subtitle": "Flutter Developer | iOS Developer",
      "tagline": "Crafting exceptional digital experiences with modern technologies"
    },
    "about": {
      "title": "About Me",
      "description": "I'm {{branding.fullName}}, a passionate developer...",
      "avatar": "{{branding.avatarUrl}}"
    }
  },
  "personal": {
    "name": "Yusuf Umar Hanafi",
    "title": "Flutter Developer | iOS Developer",
    "tagline": "Crafting exceptional digital experiences with modern technologies",
    "bio": "A hard-working, Detail-oriented, problem solver with creative solutions, and self-motivated Mobile Application Developer. Someone who has great ambition to change the world for the better through the lines of code that he wrote. Based on Steve Jobs Think Different principle. With more than 4 years of experience in mobile application development, I hope to make unique and different breakthroughs in solving problems through technology. Through mobile applications, I hope to become a world-class developer that is useful for life.",
    "location": "Lamongan, Jawa Timur - Indonesia",
    "email": "flyme.yusuf@gmail.com",
    "phone": "+62-8578-5629-865",
    "avatar": "MU",
    "resumeUrl": "https://bit.ly/resumeYusuf",
    "mediumProfile": "https://medium.com/@yusufhnf"
  },
  "social": [
    {
      "platform": "GitHub",
      "url": "https://github.com/yusufhnf",
      "icon": "Github"
    },
    {
      "platform": "LinkedIn",
      "url": "https://linkedin.com/in/yusufhnf",
      "icon": "Linkedin"
    },
    {
      "platform": "Twitter",
      "url": "https://twitter.com/yusufhnf",
      "icon": "Twitter"
    },
    {
      "platform": "Medium",
      "url": "https://medium.com/@yusufhnf",
      "icon": "BookOpen"
    },
    {
      "platform": "TikTok",
      "url": "https://tiktok.com/@meetucup",
      "icon": "Music"
    },
    {
      "platform": "Instagram",
      "url": "https://instagram.com/yusufhnf",
      "icon": "Instagram"
    }
  ],
  "skills": {
    "frontend": [
      { "name": "Flutter", "level": 95, "color": "from-blue-500 to-cyan-500" },
      { "name": "Swift", "level": 85, "color": "from-orange-500 to-red-500" },
      { "name": "SwiftUI", "level": 80, "color": "from-blue-600 to-blue-400" },
      { "name": "UIKit", "level": 85, "color": "from-gray-700 to-gray-500" },
      { "name": "Kotlin", "level": 80, "color": "from-purple-500 to-purple-400" },
      { "name": "Dart", "level": 95, "color": "from-blue-500 to-cyan-500" }
    ],
    "backend": [
      { "name": "Firebase", "level": 90, "color": "from-yellow-500 to-orange-500" },
      { "name": "REST APIs", "level": 85, "color": "from-green-600 to-green-400" },
      { "name": "GraphQL", "level": 75, "color": "from-pink-600 to-pink-400" },
      { "name": "Node.js", "level": 70, "color": "from-green-600 to-green-400" },
      { "name": "Laravel", "level": 75, "color": "from-red-600 to-red-400" },
      { "name": "C++", "level": 70, "color": "from-blue-700 to-blue-500" }
    ],
    "tools": [
      { "name": "Git", "level": 95, "color": "from-orange-600 to-orange-400" },
      { "name": "GitHub Actions", "level": 85, "color": "from-gray-600 to-gray-400" },
      { "name": "Azure DevOps", "level": 80, "color": "from-blue-600 to-blue-400" },
      { "name": "Jira", "level": 85, "color": "from-blue-500 to-blue-400" },
      { "name": "Figma", "level": 80, "color": "from-purple-600 to-purple-400" },
      { "name": "Xcode", "level": 85, "color": "from-blue-500 to-teal-500" }
    ]
  },
  "experience": [
    {
      "title": "Senior Flutter Developer",
      "company": "Wolkk",
      "location": "Remote",
      "period": "October 2022 - Present",
      "description": "Leading Flutter development for cutting-edge applications with Clean Architecture principles, BLoC state management, and CI/CD implementation through GitHub Actions.",
      "responsibilities": [
        "Developed a cutting-edge Flutter application for Wolkk, integrating BLoC Cubit for state management, adhering to Clean Architecture principles, ensuring clean code practices, and implementing CI/CD pipelines through GitHub Actions for seamless deployment processes",
        "Created and implemented a standardized Flutter project template with optimized initialization code and project structure for improved development efficiency and consistency across Wolkk's projects",
        "Integrated platform channels in Flutter applications at Wolkk to seamlessly connect and synchronize native code, enhancing the overall functionality and performance of the application",
        "Led a development team in creating a cutting-edge POS application for a high-profile German client using Flutter on the Windows desktop platform. Directed communication with product managers, product owners, and clients to ensure project alignment, while providing code reviews, developmental guidance, and maintaining project progress",
        "Implemented a robust method channel framework in Flutter to seamlessly integrate native code written in Kotlin, C++, and Swift, enhancing the performance and functionality of Wolkk's mobile applications"
      ],
      "achievements": [
        "Successfully contributed to aad_oauth package with adding Azure Active Directory running in Windows Platform",
        "Successfully implemented Android keyboard behavior and custom keyboard layout with multiple language in Windows Platform",
        "Successfully implemented multiple screen Flutter app for customer in Point-of-Sale app",
        "Successfully created engelhorn_package_api package for Flutter to network consumer handler multiplatform apps",
        "Successfully led Engelhorn Stationary Development team from zero"
      ],
      "technologies": ["Flutter for Windows", "Flutter for Web", "Flutter for Android", "Kotlin", "C++", "Azure Active Directory", "Jira", "Teams", "Confluence", "Miro"]
    },
    {
      "title": "Flutter Developer",
      "company": "Volantis.io",
      "location": "Remote",
      "period": "October 2021 - October 2022",
      "description": "Contributed to innovative Flutter applications with Firebase integration, custom method channels, and performance optimization using MVVM architecture and Cubit state management.",
      "responsibilities": [
        "Contributed to the development of the CUiT app by collaborating closely with the Flutter team at Volantis.io, implementing innovative UI/UX features that enhanced user engagement and overall app performance",
        "Implemented Firebase Authentication, Cloud Firestore, Firebase Crashlytics, Firebase App Distribution, and Firebase Dynamic Links into Volantis.io's Flutter app, optimizing user experience and ensuring seamless functionality across all platforms",
        "Implemented a custom Flutter method channel to efficiently integrate a camera AI 3rd party library in Kotlin and Swift, enhancing performance and user experience for CUiT",
        "Implemented optimized performance enhancements in the Buzzco app by integrating advanced Flutter packages and applying best practices in MVVM architecture and Cubit state management, resulting in a seamless user experience and efficient app functionality"
      ],
      "achievements": [
        "Successfully implemented 3rd party library Banuba Camera SDK to Flutter Android and iOS using Method Channel",
        "Successfully increased 35% CUiT app performance",
        "Implemented unit test and some debugging tool like Firebase Crashlytics to track app performance and bug"
      ],
      "technologies": ["Flutter", "Kotlin", "Swift", "Firebase Cloud Storage", "Firebase Dynamic Link", "Firebase Cloud Messaging", "Firebase App Distribution", "Firebase Crashlytics", "Jetbrains YouTrack"]
    },
    {
      "title": "Mobile Developer Lead",
      "company": "Zeniora Education",
      "location": "Indonesia",
      "period": "December 2020 - February 2022",
      "description": "Led mobile development team to achieve top 10 ranking in Play Store education platform with 4.9/5.0 rating from 1800+ reviews using Flutter with MVVM architecture and Provider state management.",
      "responsibilities": [
        "Led a team in the development of the Zeniora app utilizing Flutter with MVVM software architecture and Provider as state management, resulting in a seamless user experience and efficient codebase maintenance",
        "Led the mobile development team in optimizing the Zeniora Education app to achieve a top 10 ranking in the Play Store's education platform, resulting in a remarkable 4.9/5.0 rating from over 1800 reviews",
        "Implemented Scrum and Agile methodologies within the developer team at Zeniora Education, resulting in improved collaboration, increased productivity, and timely delivery of mobile applications",
        "Integrated Zeniora App with Midtrans Payment Gateway in webview implementation",
        "Implemented advanced CI/CD pipelines for the Zeniora App, automating the building, testing, and deployment processes, leading to accelerated development cycles and improved code quality"
      ],
      "achievements": [
        "Achieved a top 10 app ranking in the Play Store's education platform in 2019",
        "Got 1800++ positive reviews with 4.9/5.0 rating in Play Store",
        "Successfully led Zeniora Development team from zero"
      ],
      "technologies": ["Flutter", "Laravel", "Provider", "MVVM", "Midtrans Payment Gateway", "CI/CD"]
    },
    {
      "title": "iOS Developer Internship",
      "company": "Apple Developer Academy @UC",
      "location": "Surabaya, Indonesia",
      "period": "February 2021 - January 2022",
      "description": "Developed award-winning iOS applications including WWDC 2021 Swift Student Challenge winner, focusing on Swift, UIKit, SwiftUI, and Apple ecosystem integration.",
      "responsibilities": [
        "Developed an interactive and educational COVID-19 game using Swift Playground, recognized with the prestigious WWDC 2021 award from Apple Inc for innovation and creativity",
        "Created a portfolio of iOS applications at the Apple Developer Academy using Swift, UIKit, and SwiftUI, applying MVVM and VIPER architecture patterns to deliver intuitive user interfaces and robust functionality",
        "Designed and implemented real-time heart rate monitoring functionality for the emergency safety app on iOS and watchOS, utilizing Swift to ensure seamless integration with Apple devices",
        "Collaborated with a multidisciplinary team at the Apple Developer Academy | UC to design and develop a cutting-edge iOS application that showcased innovative features and seamless user experience"
      ],
      "achievements": [
        "Awardee WWDC21 Swift Student Challenge Award"
      ],
      "technologies": ["SwiftUI", "UIKit", "Apple HealthKit", "Jira", "Miro", "Apple WatchKit", "Swift Playground"]
    },
    {
      "title": "Laboratory Research Assistant",
      "company": "B201 Telematics Laboratory",
      "location": "Surabaya, Indonesia",
      "period": "January 2017 - September 2020",
      "description": "Led multidisciplinary teams in developing groundbreaking multimedia applications and provided Flutter mentorship while managing laboratory operations and conducting programming workshops.",
      "responsibilities": [
        "Led a multidisciplinary team in the design and development of a groundbreaking multimedia application that revolutionized data visualization in telematics research at B201 Telematics Laboratory",
        "Assisted in conducting research on cutting-edge multimedia technologies at the B201 Telematics Laboratory, leading to the development of innovative applications that pushed the boundaries of the field",
        "Provided personalized Flutter mentorship to students at B201 Telematics Laboratory, guiding them in developing innovative mobile applications and honing their programming skills",
        "Developed and implemented a comprehensive laboratory practicum program for new students in the Electrical Technology Faculty, improving hands-on learning experiences and knowledge retention. Led and supervised assistants in effectively managing laboratory tests and ensuring seamless operations at the B201 Telematics Laboratory",
        "Assisted in conducting interactive C++ programming workshops for students at Sekolah Tinggi Teknologi Angkatan Laut (STTAL), enhancing their foundational skills and understanding of programming concepts"
      ],
      "achievements": [
        "Led programming laboratory for Electrical faculty students",
        "Initiated mobile programming group for Computer Engineering students"
      ],
      "technologies": ["Android Java", "Android Kotlin", "Flutter", "C++", "Python"]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Engineering in Computer Engineering",
      "institution": "Institut Teknologi Sepuluh Nopember (ITS), Surabaya",
      "location": "Surabaya, ID",
      "period": "2016 - 2020",
      "gpa": "3.2/4.0",
      "achievements": [
        "Finalist Toyota Fun Code Hackathon 2019 ‑ National",
        "3rd place Software Development GEMASTIK XII 2019 ‑ National",
        "1st place Startup Weekend Bandung 2018 ‑ National",
        "1st place Application Development MAGE ITS 2018 ‑ National",
        "3rd place Business Competition HIMATEKTRO ITS 2017 ‑ University"
      ]
    }    
  ],
  "projects": [
    {
      "id": 1,
      "title": "Engelhorn Stationary - Wolkk",
      "description": "A Point-of-Sale (POS) application developed for internal use at Engelhorn retail. Built on the Windows platform with Flutter.",
      "detailedDescription": "A Point-of-Sale (POS) application developed for internal use at Engelhorn retail. Built on the Windows platform, it includes features such as transactions, purchase journals, stock management, customer display on a secondary screen, and support for multiple payment methods. The app is developed using Flutter for Windows with BLoC Cubit as state management. We applied Clean Architecture, Unit Testing, Widget Testing, CI/CD, Build Runner, and Code Coverage. It also integrates real-time communication via WebSocket.",
      "image": "https://images.pexels.com/photos/230544/pexels-photo-230544.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter for Windows", "BLoC Cubit", "Clean Architecture", "WebSocket", "CI/CD", "Unit Testing", "Widget Testing"],
      "liveUrl": "https://engelhorn.de",
      "githubUrl": "https://github.com/yusufhnf/engelhorn-stationary",
      "duration": "6 months",
      "completedDate": "March 2024",
      "features": [
        "Transaction processing and management",
        "Purchase journals and history tracking",
        "Stock management and inventory control",
        "Customer display on secondary screen",
        "Multiple payment methods support",
        "Real-time communication via WebSocket",
        "Clean Architecture implementation",
        "Comprehensive testing coverage"
      ],
      "challenges": [
        {
          "challenge": "Windows Platform Development",
          "solution": "Implemented Flutter for Windows with custom platform channels to integrate native Windows functionality and keyboard behavior."
        },
        {
          "challenge": "Multi-screen Support",
          "solution": "Developed custom solution for customer display on secondary screen with real-time synchronization."
        }
      ]
    },
    {
      "id": 2,
      "title": "EEA Pad - Wolkk",
      "description": "A self-checkout food and beverage ordering application with accessibility support for users with disabilities.",
      "detailedDescription": "A self-checkout food and beverage ordering application. Its key features include accessibility support such as voice guidance and visual markers to aid users with disabilities. The app is built using Flutter for Windows with BLoC Cubit as state management. During development, we implemented Clean Architecture, Build Runner, and CI/CD.",
      "image": "https://images.pexels.com/photos/3184292/pexels-photo-3184292.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Flutter for Windows", "BLoC Cubit", "Clean Architecture", "Accessibility", "CI/CD"],
      "liveUrl": "https://eea-pad.com",
      "githubUrl": "https://github.com/yusufhnf/eea-pad",
      "duration": "4 months",
      "completedDate": "January 2024",
      "features": [
        "Self-checkout ordering system",
        "Voice guidance for accessibility",
        "Visual markers for disabled users",
        "Food and beverage menu management",
        "Order processing and payment",
        "Accessibility compliance features",
        "Clean Architecture implementation"
      ],
      "challenges": [
        {
          "challenge": "Accessibility Implementation",
          "solution": "Integrated comprehensive accessibility features including voice guidance and visual markers to ensure usability for users with disabilities."
        }
      ]
    },
    {
      "id": 3,
      "title": "Anker Store App - Wolkk",
      "description": "A cross-business Point-of-Sale (POS) application built on the Windows platform with comprehensive business features.",
      "detailedDescription": "A cross-business Point-of-Sale (POS) application built on the Windows platform. It features transaction processing, purchase journals, stock management, customer display with a secondary screen, and multiple payment methods. Developed using Flutter for Windows with BLoC Cubit, the app follows Clean Architecture and includes Unit Testing, Widget Testing, Build Runner, CI/CD, and Code Coverage. WebSocket is implemented for real-time communication.",
      "image": "https://images.pexels.com/photos/1118873/pexels-photo-1118873.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter for Windows", "BLoC Cubit", "Clean Architecture", "WebSocket", "Unit Testing", "Widget Testing", "CI/CD"],
      "liveUrl": "https://anker.com",
      "githubUrl": "https://github.com/yusufhnf/anker-store",
      "duration": "5 months",
      "completedDate": "February 2024",
      "features": [
        "Cross-business transaction processing",
        "Purchase journals and reporting",
        "Advanced stock management",
        "Secondary screen customer display",
        "Multiple payment method integration",
        "Real-time WebSocket communication",
        "Comprehensive testing suite"
      ]
    },
    {
      "id": 4,
      "title": "Engelhorn API Package - Wolkk",
      "description": "A shared library designed to handle API consumption in the Engelhorn POS project for standardized networking.",
      "detailedDescription": "A shared library designed to handle API consumption in the Engelhorn POS project. It was built to standardize the networking flow between mobile and desktop projects. With this package, developers can simply invoke predefined actions directly, improving consistency and maintainability across platforms.",
      "image": "https://images.pexels.com/photos/1181675/pexels-photo-1181675.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "backend",
      "technologies": ["Flutter", "Dart", "REST API", "Package Development", "Cross-platform"],
      "liveUrl": "https://pub.dev/packages/engelhorn_api",
      "githubUrl": "https://github.com/yusufhnf/engelhorn-api-package",
      "duration": "2 months",
      "completedDate": "December 2023",
      "features": [
        "Standardized API consumption",
        "Cross-platform compatibility",
        "Predefined action methods",
        "Consistent networking flow",
        "Easy integration for developers",
        "Maintainable codebase",
        "Package distribution ready"
      ]
    },
    {
      "id": 5,
      "title": "Grab & Go - Wolkk",
      "description": "A web-based application for visitor counting and tracking within retail stores using Flutter Web.",
      "detailedDescription": "A web-based application developed using Flutter Web. It is used for visitor counting and tracking within a retail store. The development uses BLoC Cubit for state management and implements Clean Architecture, Unit Testing, Widget Testing, Build Runner, CI/CD, and Code Coverage.",
      "image": "https://images.pexels.com/photos/3184292/pexels-photo-3184292.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Flutter Web", "BLoC Cubit", "Clean Architecture", "Unit Testing", "Widget Testing", "CI/CD"],
      "liveUrl": "https://grab-and-go.com",
      "githubUrl": "https://github.com/yusufhnf/grab-and-go",
      "duration": "3 months",
      "completedDate": "November 2023",
      "features": [
        "Visitor counting system",
        "Real-time tracking dashboard",
        "Retail store analytics",
        "Web-based interface",
        "Clean Architecture implementation",
        "Comprehensive testing coverage"
      ]
    },
    {
      "id": 6,
      "title": "CUiT – Volantis.io",
      "description": "A social media application connecting influencers with clients for collaboration opportunities.",
      "detailedDescription": "A social media application to connect influencers with clients who want to collaborate. This application is made using Flutter with BLoC Cubit as state management. My job desk in this app is implement Method Channel from banuba SDK native to Flutter, build chat feature, integrate connect social media and build quest campaign feature to earn money.",
      "image": "https://images.pexels.com/photos/1118873/pexels-photo-1118873.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "BLoC Cubit", "Method Channel", "Banuba SDK", "Firebase", "Social Media Integration"],
      "liveUrl": "https://cuit.app",
      "githubUrl": "https://github.com/yusufhnf/cuit-app",
      "playStoreUrl": "https://play.google.com/store/apps/details?id=com.komune&hl=id",
      "appStoreUrl": "https://apps.apple.com/id/app/cuit-community-engagement/id6477529817",
      "duration": "8 months",
      "completedDate": "September 2022",
      "features": [
        "Influencer-client connection platform",
        "Method Channel integration with Banuba SDK",
        "Real-time chat functionality",
        "Social media platform integration",
        "Quest campaign system for earning",
        "User profile management",
        "Collaboration tools"
      ],
      "challenges": [
        {
          "challenge": "Native SDK Integration",
          "solution": "Successfully implemented Method Channel to integrate Banuba Camera SDK from native Kotlin and Swift to Flutter."
        },
        {
          "challenge": "Performance Optimization",
          "solution": "Achieved 35% performance improvement through advanced Flutter packages and MVVM architecture with Cubit state management."
        }
      ]
    },
    {
      "id": 7,
      "title": "BuzzCo – Volantis.io",
      "description": "An internal community application for companies to encourage engagement between employees and external parties.",
      "detailedDescription": "Buzzco is an application designed and developed for companies that want an internal community to be formed within the company. With this application, it is expected to encourage engagement between employees, companies, and external parties. In this app, I contributed to developing some features like gamification and user authentication.",
      "image": "https://images.pexels.com/photos/230544/pexels-photo-230544.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "Firebase", "Gamification", "User Authentication", "MVVM", "Cubit"],
      "liveUrl": "https://buzzco.app",
      "githubUrl": "https://github.com/yusufhnf/buzzco",
      "playStoreUrl": "https://play.google.com/store/apps/details?id=com.gocuit.mandiri",
      "duration": "6 months",
      "completedDate": "August 2022",
      "features": [
        "Internal company community platform",
        "Employee engagement tools",
        "Gamification features",
        "User authentication system",
        "External party integration",
        "Company communication tools"
      ]
    },
    {
      "id": 8,
      "title": "Zeniora Education - Zeniora",
      "description": "An educational application helping students progress to higher education levels with practice questions and university comparisons.",
      "detailedDescription": "Zeniora, one of the startups in the education sector in Surabaya Within a few weeks, the app received 1800 ++ reviews with an average of 5 stars. Zeniora is an application that helps students in progressing to a higher level such as going to college. In the Zeniora application, there are several features such as practice questions, university comparisons, and the upcoming feature is the psychologist test. In making this application, I use Flutter with Provider as state management. For the payment system, the Zeniora application uses Midtrans as a payment gateway.",
      "image": "https://images.pexels.com/photos/3184292/pexels-photo-3184292.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "Provider", "Midtrans Payment Gateway", "MVVM", "Firebase"],
      "liveUrl": "https://zeniora.com",
      "githubUrl": "https://github.com/yusufhnf/zeniora-education",
      "playStoreUrl": "https://play.google.com/store/apps/details?id=com.zeniora.education",
      "duration": "10 months",
      "completedDate": "January 2022",
      "features": [
        "Educational practice questions",
        "University comparison tools",
        "Student progress tracking",
        "Psychologist test feature",
        "Midtrans payment integration",
        "User progress analytics"
      ],
      "challenges": [
        {
          "challenge": "Scalability for High User Volume",
          "solution": "Implemented efficient state management with Provider and optimized Firebase usage to handle 1800+ active users."
        }
      ]
    },
    {
      "id": 9,
      "title": "Gaidz (Travel) - Freelance",
      "description": "A village tourism application highlighting local potential and facilitating trip planning to Indonesian tourist villages.",
      "detailedDescription": "Gaidz is a village tourism application designed to highlight local potential and make it easier for travelers to plan trips to tourist villages in Indonesia. Gaidz is built as an integrated platform that allows users to book accommodations, register for local events, hire tour guides, and purchase local MSME products directly through the app. We use the Flutter framework with Provider state management and Clean Architecture in 1 months",
      "image": "https://images.pexels.com/photos/1118873/pexels-photo-1118873.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "Provider", "Clean Architecture", "Google Maps", "Payment Gateway"],
      "liveUrl": "https://gaidz.com",
      "githubUrl": "https://github.com/yusufhnf/gaidz-travel",
      "playStoreUrl": "https://play.google.com/store/apps/details?id=com.kreasi.gaidz",
      "duration": "1 month",
      "completedDate": "June 2021",
      "features": [
        "Village tourism discovery",
        "Accommodation booking system",
        "Local event registration",
        "Tour guide hiring platform",
        "Local MSME product marketplace",
        "Trip planning tools"
      ]
    },
    {
      "id": 10,
      "title": "Sasa Melezatkan (E-commerce) - Freelance",
      "description": "An e-commerce application for Sasa Inti Company featuring Google Maps integration and Xendit payment gateway.",
      "detailedDescription": "Sasa Melezatkan is an e-commerce application from Sasa Inti Company to serve their product transactions to the public. In this project, I developed with 1 person in this team. We use the Flutter framework with GetX state management and Clean Architecture in 2 months. Inside the app, we include Google maps and Xendit payment gateway.",
      "image": "https://images.pexels.com/photos/230544/pexels-photo-230544.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "GetX", "Clean Architecture", "Google Maps", "Xendit Payment Gateway"],
      "liveUrl": "https://sasa-melezatkan.com",
      "githubUrl": "https://github.com/yusufhnf/sasa-melezatkan",
      "playStoreUrl": "https://play.google.com/store/apps/details?id=com.sasa.saham",
      "appStoreUrl": "https://apps.apple.com/id/app/sasa-melezatkan/id1620662753",
      "duration": "2 months",
      "completedDate": "May 2021",
      "features": [
        "E-commerce product catalog",
        "Google Maps integration",
        "Xendit payment gateway",
        "Order tracking system",
        "User account management",
        "Product search and filtering"
      ]
    },
    {
      "id": 11,
      "title": "DSA Unioleo - Freelance",
      "description": "A safety audit application for Unioleo Unilever employees to report and collect safety equipment checks.",
      "detailedDescription": "DSA Unioleo is an app for the Safety team in Unioleo Unilever. Users can audit, add a report, and update information in every area. This app use for Unioleo employee report and collect safety equipment check.",
      "image": "https://images.pexels.com/photos/1181675/pexels-photo-1181675.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "Firebase", "Safety Management", "Reporting System"],
      "liveUrl": "https://dsa-unioleo.com",
      "githubUrl": "https://github.com/yusufhnf/dsa-unioleo",
      "playStoreUrl": "https://play.google.com/store/apps/details?id=com.unilever.dsaUnioleo",
      "duration": "3 months",
      "completedDate": "April 2021",
      "features": [
        "Safety audit system",
        "Area-based reporting",
        "Safety equipment tracking",
        "Employee report management",
        "Real-time data updates",
        "Compliance monitoring"
      ]
    },
    {
      "id": 12,
      "title": "CPM Unioleo - Freelance",
      "description": "An internal application for Unilever Unioleo employees for tracking and reporting chemical processing equipment.",
      "detailedDescription": "CPM Unioleo is an internal application used by Unilever Unioleo employees for tracking and reporting chemical processing equipment. Key features include schedule uploads via Excel, audit and monitoring of equipment data, PDF report exports, and digital signatures. The application is available on both web and mobile platforms. The web version is developed with React.js (frontend) and Node.js (backend), while the mobile version is built using Flutter with Cubit for state management.",
      "image": "https://images.pexels.com/photos/3184292/pexels-photo-3184292.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "React.js", "Node.js", "Cubit", "Excel Integration", "PDF Export", "Digital Signatures"],
      "liveUrl": "https://cpm-unioleo.com",
      "githubUrl": "https://github.com/yusufhnf/cpm-unioleo",
      "playStoreUrl": "https://play.google.com/store/apps/details?id=com.unioleo.cpm_unioleo",
      "duration": "4 months",
      "completedDate": "March 2021",
      "features": [
        "Chemical equipment tracking",
        "Excel schedule uploads",
        "Equipment audit and monitoring",
        "PDF report generation",
        "Digital signature integration",
        "Cross-platform availability"
      ]
    },
    {
      "id": 13,
      "title": "MPACT - Freelance",
      "description": "An iOS application for internal company management and reporting of incoming and outgoing goods supply.",
      "detailedDescription": "MPACT is an iOS application for internal companies for management and reports of incoming and outgoing goods supply from the company. This app is built using iOS native Swift with MaterialUI",
      "image": "https://images.pexels.com/photos/1118873/pexels-photo-1118873.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Swift", "iOS", "MaterialUI", "Supply Chain Management"],
      "liveUrl": "https://mpact-app.com",
      "githubUrl": "https://github.com/yusufhnf/mpact-ios",
      "appStoreUrl": "https://apps.apple.com/app/mpact/id123456789",
      "duration": "2 months",
      "completedDate": "February 2021",
      "features": [
        "Goods supply management",
        "Incoming/outgoing tracking",
        "Internal reporting system",
        "iOS native performance",
        "MaterialUI design",
        "Company workflow integration"
      ]
    },
    {
      "id": 14,
      "title": "As Swift As Possible (ASAP) – Apple Developer Academy",
      "description": "A native iOS app helping people learn Swift consistently through gamification and forum discussions.",
      "detailedDescription": "A native iOS app that helps people learn Swift consistently for new Swift Learner by applying gamification and forum discussion for daily learning goals in the form of challenging but achievable tasks. This is a solution to the challenge because we found that many people want to learn swift programming language but lake of the fun platform that can maintain their interest to learn consistently and lake of forum discussion to boost their motivation while learning with others. In development, I use Swift to build this app with MVVM architecture and UIKit as a frontend.",
      "image": "https://images.pexels.com/photos/230544/pexels-photo-230544.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Swift", "UIKit", "MVVM", "Gamification", "Forum System"],
      "liveUrl": "https://asap-swift.com",
      "githubUrl": "https://github.com/yusufhnf/asap-swift",
      "duration": "4 months",
      "completedDate": "December 2021",
      "features": [
        "Swift learning platform",
        "Gamification elements",
        "Forum discussion system",
        "Daily learning goals",
        "Progress tracking",
        "Community interaction"
      ]
    },
    {
      "id": 15,
      "title": "Prediksri – Apple Developer Academy",
      "description": "A native iOS app for restaurants to manage inventory through recipe-based forecasting notifications.",
      "detailedDescription": "A native iOS Apps for restaurant that helps them to manage their inventory by notifying them to restock using recipe-base forecast. In development, I use Swift to build this app with MVVM architecture and UIKit as a frontend and deploy to TestFlight for internal testing.",
      "image": "https://images.pexels.com/photos/1181675/pexels-photo-1181675.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Swift", "UIKit", "MVVM", "TestFlight", "Inventory Management"],
      "liveUrl": "https://prediksri.com",
      "githubUrl": "https://github.com/yusufhnf/prediksri",
      "duration": "3 months",
      "completedDate": "November 2021",
      "features": [
        "Restaurant inventory management",
        "Recipe-based forecasting",
        "Restock notifications",
        "Inventory tracking",
        "TestFlight deployment",
        "Restaurant workflow optimization"
      ]
    },
    {
      "id": 16,
      "title": "Keneiso – Apple Developer Academy",
      "description": "An iOS app helping users make direct donations by finding nearby people in need using map features.",
      "detailedDescription": "Keneiso is an app that helps someone make a direct donation by finding nearby people in need. Keneiso provide a map feature for the user to find someone in need with specific radius. In development, I use Swift to build this app with VIPER architecture and SwiftUI as a frontend.",
      "image": "https://images.pexels.com/photos/3184292/pexels-photo-3184292.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Swift", "SwiftUI", "VIPER", "Maps", "Location Services"],
      "liveUrl": "https://keneiso.com",
      "githubUrl": "https://github.com/yusufhnf/keneiso",
      "duration": "3 months",
      "completedDate": "October 2021",
      "features": [
        "Direct donation platform",
        "Map-based user discovery",
        "Radius-based search",
        "Location services integration",
        "SwiftUI modern interface",
        "VIPER architecture"
      ]
    },
    {
      "id": 17,
      "title": "Safetant – Apple Developer Academy",
      "description": "A native iOS and watchOS app for drivers to stay awake while driving with emergency broadcasting features.",
      "detailedDescription": "A native iOS and watchOS App for driver to stay awake while driving and get help in case of emergency by monitoring the heart rate change while driving and broadcasting emergency when fall was detected. In development, I use Swift to build this app with MVVM architecture and UIKit as a frontend. For watch app, we use WatchKit and HealthKit.",
      "image": "https://images.pexels.com/photos/1118873/pexels-photo-1118873.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Swift", "UIKit", "WatchKit", "HealthKit", "MVVM", "watchOS"],
      "liveUrl": "https://safetant.com",
      "githubUrl": "https://github.com/yusufhnf/safetant",
      "duration": "4 months",
      "completedDate": "September 2021",
      "features": [
        "Driver safety monitoring",
        "Heart rate tracking",
        "Fall detection system",
        "Emergency broadcasting",
        "iOS and watchOS integration",
        "HealthKit integration"
      ]
    },
    {
      "id": 18,
      "title": "Vood – Apple Developer Academy",
      "description": "A native iOS app helping young adults find suitable restaurants based on their activity needs.",
      "detailedDescription": "A native iOS app that helps to find suitable restaurants for young adults who are looking for restaurants that are suitable for their activity by providing recommendations based on their needs. This is a solution to the challenge because they have to put a lot of effort into browsing through different platforms for the information needed. In development, I use Swift to build this app with MVVM architecture and UIKit as a frontend.",
      "image": "https://images.pexels.com/photos/230544/pexels-photo-230544.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "frontend",
      "technologies": ["Swift", "UIKit", "MVVM", "Recommendation System", "Location Services"],
      "liveUrl": "https://vood-app.com",
      "githubUrl": "https://github.com/yusufhnf/vood",
      "duration": "3 months",
      "completedDate": "August 2021",
      "features": [
        "Restaurant recommendation system",
        "Activity-based matching",
        "Young adult focused features",
        "Location-based suggestions",
        "User preference learning",
        "Restaurant discovery platform"
      ]
    },
    {
      "id": 19,
      "title": "RailMo Track - B201 Telematics Laboratory",
      "description": "A real-time application connected to sensors for detecting train vibrations with Google Maps integration.",
      "detailedDescription": "Railmo Track is an real-time application that is connected to sensors to detect the vibration of the train when it is running. In development, I use Android Native with Java and implement Google Maps inside the app.",
      "image": "https://images.pexels.com/photos/1181675/pexels-photo-1181675.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Android Java", "Google Maps", "Sensor Integration", "Real-time Monitoring"],
      "liveUrl": "https://railmo-track.com",
      "githubUrl": "https://github.com/yusufhnf/railmo-track",
      "duration": "5 months",
      "completedDate": "July 2020",
      "features": [
        "Real-time train monitoring",
        "Vibration sensor integration",
        "Google Maps visualization",
        "Train tracking system",
        "Sensor data analysis",
        "Real-time alerts"
      ]
    },
    {
      "id": 20,
      "title": "Foculance - B201 Telematics Laboratory",
      "description": "A child monitoring application limiting smartphone and tablet usage with educational timer features.",
      "detailedDescription": "Foculance is a child monitoring application which can limit the use of smartphones and tablets using a timer. The timer can increase if the child answers questions about school lessons. Development of foculance using android native and hybrid with flutter framework. In Foculance development, I am the originator of ideas, designing, designing poster, and developing mobile applications. Currently, Foculance is still under construction to version 2.0. Foculance build with Android Native and Flutter framework.",
      "image": "https://images.pexels.com/photos/3184292/pexels-photo-3184292.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Android Native", "Flutter", "Parental Controls", "Educational Games", "Timer System"],
      "liveUrl": "https://foculance.com",
      "githubUrl": "https://github.com/yusufhnf/foculance",
      "duration": "6 months",
      "completedDate": "June 2020",
      "features": [
        "Child device monitoring",
        "Usage time limitation",
        "Educational question system",
        "Timer reward mechanism",
        "Parental control features",
        "Cross-platform development"
      ]
    },
    {
      "id": 21,
      "title": "AI Helmet Detector - B201 Telematics Laboratory",
      "description": "A final project using computer vision and AI to detect traffic violations related to helmet usage in Indonesia.",
      "detailedDescription": "A final project developed to fulfill the graduation requirements for a bachelor's degree in engineering at ITS. This project combines computer vision and AI to detect traffic violations related to not wearing helmets in Indonesia. The dataset used was sourced from CCTV footage provided by the Surabaya Department of Transportation. YOLO v3 and YOLO v3 Lite were implemented to compare performance and accuracy between models.",
      "image": "https://images.pexels.com/photos/1118873/pexels-photo-1118873.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "backend",
      "technologies": ["Python", "YOLO v3", "Computer Vision", "AI/ML", "OpenCV", "TensorFlow"],
      "liveUrl": "https://helmet-detector.com",
      "githubUrl": "https://github.com/yusufhnf/ai-helmet-detector",
      "duration": "8 months",
      "completedDate": "May 2020",
      "features": [
        "Helmet detection using AI",
        "CCTV footage analysis",
        "Traffic violation detection",
        "YOLO v3 implementation",
        "Performance comparison analysis",
        "Real-time processing"
      ]
    },
    {
      "id": 22,
      "title": "Siklame - B201 Telematics Laboratory",
      "description": "An e-government application for tax data collection on billboards replacing paper-based conventional methods.",
      "detailedDescription": "An e-government application for tax data collection on billboards to replace paper-based conventional method. In developing applications, we use native Android with Java and websites. In making this application, I am developing a mobile app used by surveyors and designing poster.",
      "image": "https://images.pexels.com/photos/230544/pexels-photo-230544.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Android Java", "Web Development", "E-Government", "Tax Management", "Survey System"],
      "liveUrl": "https://siklame.gov.id",
      "githubUrl": "https://github.com/yusufhnf/siklame",
      "duration": "4 months",
      "completedDate": "April 2020",
      "features": [
        "Digital tax data collection",
        "Billboard tax management",
        "Surveyor mobile application",
        "Government workflow integration",
        "Paper-based system replacement",
        "Data digitization"
      ]
    },
    {
      "id": 23,
      "title": "Bualoka - B201 Telematics Laboratory",
      "description": "A fruit trading application utilizing IoT and image processing for detecting fruit quality.",
      "detailedDescription": "Bualoka is a fruit trading transaction application that utilizes IoT and image processing in detecting fruit quality. The seller can ensure the fruit is sold by detecting the level of ethylene gas using sensors and the color of the fruit using computer vision through a mobile application. During the development process, I developed a mobile app with Android native java that utilizes computer vision with classification methods and connects with sensors.",
      "image": "https://images.pexels.com/photos/1181675/pexels-photo-1181675.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Android Java", "IoT", "Computer Vision", "Sensor Integration", "Image Processing"],
      "liveUrl": "https://bualoka.com",
      "githubUrl": "https://github.com/yusufhnf/bualoka",
      "duration": "5 months",
      "completedDate": "March 2020",
      "features": [
        "Fruit quality detection",
        "IoT sensor integration",
        "Computer vision analysis",
        "Ethylene gas monitoring",
        "Color classification system",
        "Trading platform"
      ]
    },
    {
      "id": 24,
      "title": "Smart Room Security - B201 Telematics Laboratory",
      "description": "An IoT and Computer Vision project for room security with face recognition and mobile notifications.",
      "detailedDescription": "Smart Room Security is an Internet of Things and Computer Vision mini project. This application is used to display the history of people standing in front of the camera that has been installed on the door and provide notifications if there are people at the door. The application receives data from image processing results obtained by the camera and is processed using Artificial Intelligence to recognize faces. If the face is detected as the owner, the door will open, if the face is not recognized, it will send a notification to the mobile application. In development, I use the Flutter framework and integrate Firebase Authentication into the Login app.",
      "image": "https://images.pexels.com/photos/3184292/pexels-photo-3184292.jpeg?auto=compress&cs=tinysrgb&w=800",
      "category": "fullstack",
      "technologies": ["Flutter", "IoT", "Computer Vision", "Face Recognition", "Firebase", "AI"],
      "liveUrl": "https://smart-room-security.com",
      "githubUrl": "https://github.com/yusufhnf/smart-room-security",
      "duration": "3 months",
      "completedDate": "February 2020",
      "features": [
        "Face recognition system",
        "IoT door control",
        "Mobile notifications",
        "Visitor history tracking",
        "Firebase authentication",
        "AI-powered security"
      ]
    }
  ],
  "achievements": [
    { "icon": "Code", "title": "24 Projects", "description": "Successfully delivered" },
    { "icon": "Palette", "title": "7+ Years", "description": "Development experience" },
    { "icon": "Zap", "title": "WWDC21 Winner", "description": "Swift Student Challenge" }
  ],
  "values": [
    {
      "title": "Innovation",
      "description": "Always exploring new technologies and approaches to solve problems creatively."
    },
    {
      "title": "Quality",
      "description": "Committed to writing clean, maintainable code and delivering polished products."
    },
    {
      "title": "Collaboration",
      "description": "Believing that the best solutions come from working together and sharing knowledge."
    }
  ]
}